var array = ["Кот","Кошка","Белка"];
//alert (array[0]);
//alert (array[1]);
//alert (array[2]);
//console.log( array.length)

/*for (var i = 0; i < array.length; i++) {
	if(array[i] == "Кошка"){
		console.log("У меня есть " +  array[i] + " " + "Мурка")
	}
	if(array[i] == "Кот"){
		console.log("У меня есть " + "" + array[i] )
	}
}*/

//----------------------------------------------------------------------

/*array.pop(); // удаляет последний елемент масива
console.log(array);*/

//----------------------------------------------------------------------

/*array.push("привет","мой","друг",["Z","TTTTTTTTarget"]); // добавляет последний елемент масива
console.log(array[6][1]);*/

//----------------------------------------------------------------------

/*array.shift();//удаляет первый елемент масива
console.log(array[6][1]);*/

//---------------------------------------------------------------------

/*array.unshift("привет","мой","друг",["Z","TTTTTTTTarget"]);//добавляет первый елемент масива
console.log(array[6][1]);*/